year <- c(2011:2017)
지역GDP <- c(12207092, 13193136, 13960947, 15147843, 
           16946709, 18719373, 19981072 ) #백만원
소비자물가지수 <- c(95.76, 96.93, 98.27, 99.37, 100.00, 101.29, 103.62 )
농가인구 <- c(114062, 113298, 11174, 109510, 93404, 88385, 86463 )  # 명
농가소득 <- c(11266, 12005, 10037, 9001, 7713, 8198, 13302 )    #단위: 천원

감귤생산량 <- c(588054, 668610, 672267, 696762, 635032, 599642, 576722 )
수출금액 <- c(99735, 107942, 103285, 106415, 121068, 128994, 155362 )
사업체수 <- c(47144, 49252, 51727, 53897, 55155, 57791, 60063 )
관광객수 <- c(8740976, 9691703, 10851265, 12273917, 13664395, 15852980, 14753236 )

순이동자수<- c(2343,	4876,	7823,	11112,	14257,	14632,	14005)
주민등록인구 <- c(583284,	592449,	604670,	621550,	641355,	661190,	678772)
인구성장률 <- c(1.1,	1.6,	2.1,	2.8,	3.2,	3.1,	2.7)

jeju_eco<- data.frame(year,지역GDP,소비자물가지수,농가인구,농가소득,
                      감귤생산량,수출금액,사업체수,관광객수)

new <- data.frame(지역GDP, 순이동자수, 주민등록인구, 인구성장률)
cor(new)

setwd("D:/workR/team_data")
grdp_person<- read.csv(file="1인당_GRDP_시도.csv")
grdp_person <- data.frame(grdp_person)
str(grdp_person)
grdp_person <- t(grdp_person)
grdp_person
