# setwd("D:/workR/team_data")
# grdp_person<- read.csv(file="1인당_GRDP_시도.csv")
# grdp_person <- data.frame(grdp_person)
# str(grdp_person)
# grdp_person <- t(grdp_person)
# grdp_person[,17]

# 데이터 탐색과정
year <- c(2010:2017)
지역GDP <- c(11158882, 12207092, 13193136, 13960947, 15147843, 16946709, 18719373, 19981072 ) #단위 :백만원(2010~2017)
grdp_person <- c(19892, 21391, 22658, 23152, 24149, 25642, 27461, 28420)  #단위 :천원(2010~2017)

#선행지수 변수(2010~2018)
소비자물가지수 <- c(91.82, 95.76, 96.93, 98.27, 99.37, 100.00, 101.29, 103.62, 105.42) #2015=100
건축허가면적 <- c(1592.80,	2340.50,	2475.80,	2205.60,	3459.50,	3857.00,	4781.30,	3534.90,	2348.00)

#동행지수 변수

취업자수 <- c(284, 294, 303, 309, 322, 339, 355, 374)  #단위 : 천명
관광객수 <- c(7578301, 8740976, 9691703, 10851265, 12273917, 13664395, 15852980, 14753236) #단위 : 명
광공업생산지수 <- c(78.87,	84.64,	87.93,	91.37,	93.05,	100,	101.75,	112,	113.17) #2015=100

#일반 변수
수출금액 <- c(98042, 99735, 107942, 103285, 106415, 121068, 128994, 155362) #단위 : 천달러
농가인구 <- c(114539, 114062, 113298, 111745, 109510, 93404, 88385, 86463)  # 명
농가소득 <- c(17967, 11266, 12005, 10037, 9001, 7713, 8198, 13302)    #단위: 천원
감귤생산량 <- c(568478, 588054, 668610, 672267, 696762, 635032, 599642, 576722) # 단위 : M/T
사업체수 <- c(45830, 47144, 49252, 51727, 53897, 55155, 57791, 60063 ) #단위:개 (2010~2017)
jeju<- data.frame(year,지역GDP, grdp_person, 소비자물가지수, 취업자수, 관광객수, 수출금액, 농가인구,농가소득,
                      감귤생산량, 사업체수)
jeju
cor(jeju)
pairs(jeju, main= "multi plots")

#인구관련 변수(2010~2018)
# 순이동자수<- c(437, 2343, 4876, 7823, 11112, 14257, 14632, 14005, 8853)                   #단위 : 명
# 등록외국인 <- c(5932, 7128, 8736, 10864, 14204, 16960, 19593, 21689, 24841)               #단위 : 명
# 주민등록인구 <- c(571255, 576156, 583713, 593806, 607346, 624395, 641597, 657083, 667191) #단위 : 명
# 인구성장률 <- c(1.63,  1.06,  1.57,  2.06,  2.79,  3.19,  3.09,  2.66,  1.95 )            #단위 : %

순이동자수<- c(437, 2343, 4876, 7823, 11112, 14257, 14632, 14005)                   #단위 : 명
등록외국인 <- c(5932, 7128, 8736, 10864, 14204, 16960, 19593, 21689)               #단위 : 명
주민등록인구 <- c(571255, 576156, 583713, 593806, 607346, 624395, 641597, 657083) #단위 : 명
인구성장률 <- c(1.63,  1.06,  1.57,  2.06,  2.79,  3.19,  3.09,  2.66)            #단위 : %

#인구와 경제의 상관관계(유의함을 증명)
pop <- data.frame(지역GDP, 순이동자수,등록외국인, 주민등록인구, 인구성장률)
pairs(pop, main= "multi plots")
cor(pop)

model.pop <- lm(지역GDP~., data = pop)
model.pop
summary(model.pop)

plot(model.pop)

library(MASS)
model.pop1 <- stepAIC(model.pop)

summary(model.pop1)


